tap "applegamer22/tap"
tap "cantino/mcfly"
tap "derailed/k9s"
tap "edgedb/tap"
tap "espanso/espanso"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "kidonng/malt"
tap "koekeishiya/formulae"
tap "txn2/tap"

# Simple, modern, secure file encryption
brew "age"
# Automate deployment, configuration, and upgrading
brew "ansible", link: false
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antidote"
#A cross-platform caffeinate alternative that keeps your screen on
brew "applegamer22/tap/cocainate"
# Download with resuming and segmented downloading
brew "aria2", link: false
# Extendable version manager
brew "asdf"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Official Amazon AWS command-line interface
brew "awscli"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Fly through your shell history
brew "cantino/mcfly/mcfly"
# Insanely fast image printing in your terminal
brew "catimg"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Make choices on the command-line
brew "choose"
# Console Matrix
brew "cmatrix"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Fix common misspellings in source code and text files
brew "codespell"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# DuckDuckGo from the terminal
brew "ddgr"
# Kubernetes CLI to manage your clusters
brew "derailed/k9s/k9s"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose", link: false
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Run arbitrary commands when files change
brew "entr"
# Cross-platform Text Expander written in Rust
brew "espanso"
# Modern replacement for 'ls'
brew "exa"
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
brew "felixkratz/formulae/svim"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
brew "ghq"
brew "git-flow"
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Distributed revision control system
brew "git"
brew "gitlint"
brew "gitmoji"
brew "gitup"
# Core application library for C
brew "glib"
brew "glow"
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg@2.2", link: true
brew "go-task/tap/go-task"
brew "gobject-introspection"
brew "goenv"
brew "golangci-lint"
brew "gopls"
brew "gpg"
brew "gping"
brew "graphviz"
brew "grc"
brew "himalaya"
brew "howdoi"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
brew "imagemagick"
brew "jenv"
brew "jesseduffield/lazydocker/lazydocker"
brew "jobber"
# Lightweight and flexible command-line JSON processor
brew "jq"
brew "just"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd", restart_service: true
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "kubernetes-cli"
brew "kubie", args: ["build-from-source"]
# Simple terminal UI for git commands
brew "lazygit"
# C library implementing the SSH2 protocol
brew "libssh2"
brew "librsvg"
brew "linklint"
brew "lnav"
brew "lolcat"
brew "ltex-ls"
# Mac App Store command-line interface
brew "mas"
brew "mdcat"
brew "minio/stable/mc"
brew "mkdocs"
brew "navi"
brew "ncmpcpp"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
brew "newsboat"
# Port scanning utility for large networks
brew "nmap"
brew "nomino"
brew "nsnake"
brew "nyancat"
brew "onefetch"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
brew "openssl@1.1"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Password manager
brew "pass"
brew "pdfgrep"
brew "pinentry-mac"
brew "pinentry"
brew "pipes-sh"
brew "pipx"
brew "pre-commit"
brew "procs"
brew "pueue"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Python version management
brew "pyenv"
brew "pyright"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10", link: false
brew "qrcp"
brew "rbenv"
brew "rdfind"
brew "readline", link: true
brew "reattach-to-user-namespace"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
brew "rlwrao"
brew "rmlint"
brew "rsc_2fa"
brew "rsync"
brew "ruby"
# Rust installer - Safe, concurrent, practical language
brew "rustup-init"
brew "sampler"
brew "sd"
brew "secretive"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck", link: false
brew "sl"
brew "slides"
brew "speedtest-cli"
# Autoformat shell script source code
brew "shfmt"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Cross-shell prompt for astronauts
brew "starship"
brew "task"
brew "tealdeer"
brew "terraform-docs"
# Tool to build, change, and version infrastructure
brew "terraform"
brew "tflint"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
# Terminal multiplexer
brew "tmux"
brew "tmuxinator"
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
brew "universal-ctags"
brew "up"
brew "viddy"
# Vi 'workalike' with many additional features
brew "vim"
brew "watchman"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Internet file retriever
brew "wget"
brew "wireguard-tools"
brew "wtf"
brew "wtfutil"
brew "xh"
brew "xpdf"
brew "xplr"
brew "xsv"
brew "yamllint"
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq", args: ["HEAD"]
brew "zinit"
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"

# GPU-accelerated terminal emulator
cask "alacritty"
cask "aldente"
# Application launcher and productivity software
cask "alfred"
cask "android-platform-tools"
cask "android-sdk"
cask "bartender"
cask "betterdisplay"
cask "betterdummy"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
cask "cryptomator"
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
cask "dropbox"
cask "eloston-chromium"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-computer-modern"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-hack"
cask "font-inconsolata"
cask "font-iosevka-aile"
cask "font-iosevka-etoile"
cask "font-iosevka-sparkle"
cask "font-iosevka-ss08"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-material-icons"
cask "font-powerline-symbols"
cask "font-source-code-pro"
cask "freetube"
cask "gitkraken"
cask "goneovim"
# Web browser
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "ha-menu"
cask "he3-app/he3/he3"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-based terminal emulator
cask "kitty"
cask "lens"
cask "lulu"
cask "lunar"
cask "mactex-no-gui"
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
cask "monitorcontrol"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
cask "oracle-jdk"
cask "postman"
cask "quicklook-json"
cask "quicklookase"
cask "rar"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
cask "robo-3t"
cask "session-manager-plugin"
cask "sizeup"
cask "skim"
# Team communication and collaboration software
cask "slack"
cask "sloth"
cask "standard-notes"
cask "stats"
cask "suspicious-package"
cask "temurin8"
cask "utm"
# Development environment
cask "vagrant"
cask "vimac"
cask "virtualbox"
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
cask "xbar"
cask "xscope"
cask "zenmap"
# Video communication and virtual meeting platform
cask "zoom"

mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Dark Reader for Safari", id: 1438243180
mas "Keynote", id: 409183694
mas "Micro Snitch", id: 972028355
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Raivo OTP", id: 1498497896
mas "Surfshark", id: 1437809329
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Vimari", id: 1480933944
mas "WhatsApp", id: 1147396723
mas "Wireguard", id: 1451685025
mas "Xcode", id: 497799835
